[
  {
    "need": "In New PO Suggestions and Change Suggestions (from main menu and Buyer Workbench), for a Purchase Direct job material or subcontract operation, the customer wishes to have a field that shows the Sales Order Number that the Job is linked to (from Demand Link for the job, DB field is JobProd.OrderNum) and the Customer Name for that Sales Order (CustName).\n",
    "solution": "To add the Sales Order Number and Customer Name fields to the New PO Suggestions and Change Suggestions screens, we will use a combination of App Studio Layers and BPMs. Here's the proposed solution:PO Suggestions and Change Suggestions Screens:To enhance the PO Suggestions and Change Suggestions screens, we will add two new columns to the existing grids:· Sales Order Number: to display the linked Sales Order Number.· Customer Name: to display the Customer Name associated with the linked Sales Order.BPM for Data Retrieval:A new BPM Data Directive will be added to retrieve the Sales Order Number and Customer Name when the data is loaded into the tables that support the PO Suggestions and Change Suggestions screens. This BPM will:1. Trigger when the records are retrieved for tables that support the grid views in the PO Suggestions and Change Suggestions screens.2. For each record, retrieve the corresponding Job Number associated with the Purchase Direct job material or subcontract operation.3. Use the retrieved Job Number to retrieve the linked Sales Order Number from the JobProd.OrderNum field.4. Use the retrieved Sales Order Number to query the Sales Order table and retrieve the associated Customer Name.5. Add the Sales Order Number and Customer Name values to the datasetNotes:- All customizations will be completed in the Kinetic UI"
  },
  {
    "need": "Crystal Fountains requires the ability to add warranties to quotes as separate items. The system should allow for clear identification and distinction between different warranty durations, such as 2-year and 3-year warranties, with the flexibility to add more types and change percentages inf the future if needed.The warranty amount should be automatically calculated based on a percentage of the total quote value. The calculation formula should be as follows:· For 2 years: Warranty amount = Order value * 5%· For 3 years: Warranty amount = Order value * 10%For more than 3 years: Warranty amount = Order value * X%, where X is a defined percentage for each additional yearThe system should handle these calculations automatically without requiring manual input from the user. As line items or parts on the quote are adjusted (added, removed, or modified), the warranty amount should dynamically update to reflect the changes in real-time.The percentage used for calculating the warranty amount should be configurable by the user. The system should provide a user-friendly interface to easily update this percentage for future quotes, with default values of 5% for 2 years and 10% for 3 years. The ability to change the percentage for each year should be restricted to authorized personnel only.The warranty should be included in all relevant reports and quotes, making it easy for users to identify the warranty amount, percentage, and number of years applied to each quote. The warranty information should seamlessly flow through to the sales order and be visible there.When a quote with a warranty is converted to an invoice, the warranty line item should carry over seamlessly, ensuring that the invoicing process handles the warranty amount correctly and includes it in the total invoice value.",
    "solution": "To address Crystal Fountains' requirements, we will modify the Misc. Code entry screen in Epicor. The following customizations will be implemented:1. Add a new UD field called \"Warranty Percentage\" to the Misc. Code table and entry screen. This field will allow users to enter the desired warranty percentage for each Misc. Code.2. A BPM will be added that will be triggered whenever the \"Warranty Percentage\" field is updated. This BPM will perform the following actions:a. Check if the Misc. Code is set to a \"Percent\" type code. If not, update the Misc. Code type to \"Percent\".b. Calculate the actual percentage by multiplying the entered \"Warranty Percentage\" value by 75% (e.g., 5% * 75%).c. Update the default percentage value for the Misc. Code with the calculated actual percentage.d. Set the default for the Misc. Code to \"First\".This solution will allow Crystal Fountains to us standard misc. codes in Epicor to add warranty to quotes. The user can simply add a misc. code, select the warranty type and the rest will be calculated automatically as it works by default in Epicor. The only change we are making here is to simply the entry of these Misc. Codes for warranty purposes and allowing the user to set the warranty amount instead of having to calculate a combined percentage. .Notes and Assumptions:· Crystal Fountains will be responsible for creating and maintaining the desired \"warranty\" Misc Codes with appropriate descriptions, names, and warranty percentages.· The customizations will be developed in the Kinetic UI.· No modifications will be made to the quote entry process. Misc Charges will be added to quotes as they normally are.· If desired, Crystal Fountains can consider modifying the SSRS form for the quote at a later date to display the warranty Misc Charges according to their preferences on the quote forms. This will be a separate customization effort.· Misc. Codes will move from the quote to the order to the invoice by default in Epicor so there is no customization effort needed here.· Security can be controlled by controlling who has access to the Misc Charge Entry form. Through menu security. This is to be setup by Crystal Fountains as a part of their PH1 project if desired."
  },
  {
    "need": "Renate might have already brought this up to you but we are looking to set up some sort of automated customer statement email send from Epicor. This is our current process (all manual):1. Run a BAQ to see which customers have open invoice and credit memo balances2. Go to the customer statement report app. Filter by specific customer and send email directly from Epicor (manually input email, header, email title etc).3. Rinse and repeat for each customerthat needs a statement4. This is done twice a month (15th and 30th)We are hoping we can set up a process more like this:1. We set the frequency of statement emails sent (can be changed by us easily)2. Only customers with an open balance will receive statements (we can only change this easily, say if we decide only with open balances > $XX)3. We can set a flag on the customer record to indicate whether they will receive automatic statements.4. Emails are sent out to primary billing contact set on customer record, with a standard template email.I believe we have advanced print routing so this should be doable as Ted helped us set up something similar for our AR invoices. Could you help get this rolling for us?",
    "solution": "To automate the customer statement email process we will complete the following:Customer EntryA new UD field will be created on the Customer table called \"Auto Statement\". It will be displayed in customer entry as a checkbox to indicate if the customer should receive automatic statements.Minimum Balance ThresholdA new UD field will be created called “Customer Statement Min Balance” which will be displayed in Company Config. This is a Decimal field that will set the minimum balance before customers are sent statements.Scheduled Customer StatementsA function will be developed called \"SendCustomerStatements\" that will be responsible for generating and sending the statements. This function will:· Retrieve a list of customers with open balances (invoices and credit memos) based on the specified minimum balance threshold.· Filter the list of customers based on the \"Auto Statement\" flag.· For each eligible customer, generate the customer statement report using the default Epicor report.· Email the generated statement to the primary billing contact defined on the customer record.· Use a standard email template for the statement emails, including a predefined subject and body. (this body and header is to be provided by AML)This function will be scheduled to run on the 15th and 30th of each month.Note:· All customizations will be completed in the Kinetic UI.\n"
  },
  {
    "need": "Crystal Fountains needs to manage their bidding and submittal process within Kinetic.The following functionality is critical to this process:· Managing multiple water features under a single project.· Visibility and management of quotes to multiple contractors for a single project or feature.· Easily issuing the same quote to multiple parties with or without modifications.· Tracking all contractors that are involved with a given feature or project· Easily converting quotes to orders and automatically closing ‘competing’ quotes",
    "solution": "Quote EntrySeveral fields will be added to the quote entry screen to facilitate linking quote headers to project phases and quote revisions. All these fields will be displayed at the Header Detail level on the quote screen and none of them (except for leading quote) are directly modifiable by the user as they will be automatically updated by various processes.1. Project: Will display the project ID that a quote is linked to.2. Water Feature: Will display the Phase ID of the project that the quote is linked to3. Revision: Will display the quote revision in relation to the customer and water feature this quote is linked to.4. Parent Quote: Will display the quote number that this quote was duplicated from. If the quote was duplicated from the initial template (Base Quote) then this will display that value. However, if this is a revision of a quote that was already copied from a base quote this will show the value of the previous revision of quote for the given contractor and water feature.5. IsWaterFeatureTemplate: Will denote if this quote is a template for other quotes to be based on for water features. Value is Boolean however this will only be shown as a label on the quote if it is true.· Example:6. LeadingQuote: Will denote if this quote is the leading quote for a water feature. (A BPM will trigger when this checkbox is checked that determines if there are any other open quotes that are marked as the Leading quote for the given water feature and if there are will disallow this selection and note which quote is marked as the current leading quote.)Quotes that are linked to projects can ONLY be created from within Project Entry. After they are created they are edited within quote entry but copying a quote directly in quote entry will not link it to a project or increase revision status etc.Project EntryWe will utilize Project Phases as the holding object for water features. Each project will have a phase called “Water Features” with a sub phase for each water feature. A quote can be linked to these water features phases for each of the selected contractors. When quotes are revised a new quote will be created for each new revision and these will also be linked to the same phase. The structure of the project will look similar to the following:Project:· Phase Level 1: “Water Features”· Phase Level 2: “Water Feature 1”· Quote Rev 1: Contractor 1· Quote Rev 2: Contractor 1· Quote Rev 1: Contractor 2· Phase Level 2: “Water Feature 2”· Quote Rev 1: Contractor 1· Quote Rev 1: Contractor 3· Phase Level 3: “Water Feature 3”Additionally, a UD table will be added to Project that will store the various contractors that are being quoted to for this project.To facilitate the most streamlined modification of these contractors, phases and quotes A new “Water Features” panel will be added to Project entryFigure 1: Example of what the water features panel may look like. This is subject to change based on final interpretation.1. Add Contractor: Clicking this button will open a search panel to allow the use to search for a customer in Epicor. Upon selection of a customer, it will be added to the grid as seen in “Figure 1 - Item 2”2. Contractor Grid: Displays all contractors that have been added to the project. Fields are as follows:· Contractor: Displays the Contractor (customer) name· Quote Value: Displays the sum total value of the latest revision of all quotes for all water features that have been quoted to the given contractor. In the native currency of the contractor· Margin: Displays the total gross margin value for the latest revision of all quotes for all water features that have been quoted to the given· Order Value: Displays the sum total value of all orders for all water features that have been ordered by the given contractor.· Margin: Displays the total gross margin value for all orders for all water features that have been ordered by the given contractor.Notes: Gross margin calculations for quotes and orders are as described in the design document for case 33863. Add Water Feature: Clicking this button will open a slide out panel where the user can type in the water feature name and description. Upon saving the following will occur:· If this is the first water feature being added “Crystal Fountains” will automatically be added as a contractor on this project before the phase or quote are created.· A new sub phase will be added beneath the “Water Features” phase on the project. This phase will use the provided name for “PhaseID” and the provided description for “PhaseDescription”· A New UD field on WBSPhase will be used to denote this Phase as a “Water Feature”· An empty “template” quote will be added to the phase. The customer for this quote will be “Crystal fountains” and the quote will have the UD field “IsWaterFeatureTemplate” set to true.· This quote is what will be used as a template (base quote) for all future quotes for this water feature.4. Create Quote: Clicking this button will create a new quote for the selected water feature for the selected contractor. If there is either no water feature or contractor selected then an error will be shown.· If a quote already exists for the Contractor/Water Feature in question then a popup will state that this is the case and ask if the user would like to create a new revision. If the user selects yes then the original quote for this Contractor/Water Feature combination will be duplicated and the revision value will be increased by one. The original quote will then be closed.· If a quote does not exist for the Contractor/Water Feature in question then the “template” quote (which is the latest quote revision for the customer Crystal Fountains against this water feature) will be duplicated replacing Crystal Fountains with the selected Contractor as the customer and setting the quote revision back to “1”.5. Water Feature Grid: Displays water feature information and quote numbers for said water features depending on if the selected contractor in the contractor grid has a quote for a given water feature. Note that ALL water features (WBS Phases) will be always shown in this grid. Just the “Quote” field will change dynamically based on the selected contractor.· Quote: Displays the Quote Number of the latest quote revision that is linked to the selected water feature whose customer ID matches the customer ID of the selected contractor from the contractor grid. If the current contractor has no quotes available then nothing is shown.· Name: Displays the WBS Phase ID for the water feature in question· Description: Displays the WBS Phase Description for the water feature in question.· Additional Fields can be added such as “quoted” to display if a quote is finalized for this water feature etc. Adding these fields is not in scope and will require additional scoping to be done to determine effort.Additional Notes / Features:· When quotes are created the new Project, WaterFeature, Revision, ParentQuote fields will be updated accordingly to ensure that quotes are linked to the correct projects and revisions are aligned.· Deleting a contractor will result in an error unless that contractor has no quotes that are linked to the project.· Deleting a quote will be disallowed from anywhere in Epicor if it is a template quote or if it is the parent quote for another quote. If a quote is deleted the previous revision will not automatically be reopened.· If a quote has “IsWaterFeatureTemplate” set to “true”. All lines added to that quote will automatically have the “Template” value set to true as well.· When a quote for a feature is marked as “Won” all other quotes for said feature will be automatically closed across all other contractors.· All work will be completed in the Kinetic EnvironmentSix S may accept minor changes in scope at our discretion, however these changes may need to be quoted for additional time and cost."
  },
  {
    "need": "Request:· Assume user is about to report quantity from a Job using Epicor Kinetic Job Receipt to Inventory program.· Need a BPM that compares the Job’s current Prod Qty (JobHead.ProdQty) against the total of (JobHead.QtyCompleted + PartTran. ThisTranQty). If (JobHead.QtyCompleted + PartTran. ThisTranQty) <= JobHead.ProdQty, allow the transaction to proceed. If (JobHead.QtyCompleted + PartTran. ThisTranQty) > JobHead.ProdQty, stop the transaction with an error message telling the user they will exceed the job quantity needed.Request:· Assume user is about to report quantity from a Job using Epicor Kinetic Job Receipt to Inventory program.· Need a BPM that compares the Job’s current Prod Qty (JobHead.ProdQty) against the total of (JobHead.QtyCompleted + PartTran. ThisTranQty). If (JobHead.QtyCompleted + PartTran. ThisTranQty) <= (JobHead.ProdQty plus 10%), allow the transaction to proceed. If (JobHead.QtyCompleted + PartTran. ThisTranQty) > (JobHead.ProdQty plus 10%), stop the transaction with an error message telling the user they will exceed the job quantity needed.",
    "solution": "To address Avis Industrial's requirement, a BPM will be developed that intercepts the reporting action when reporting Job Receipt to Inventory. This BPM will compare the sum of the current quantity completed (JobHead.QtyCompleted) and the quantity being reported at the time of transaction (PartTran.ThisTranQty) with the job’s total production quantity (JobHead.ProdQty).If the sum is less than or equal to the production quantity plus 10%, the BPM will allow the transaction to proceed. Conversely, if the sum exceeds the production quantity plus 10% , the BPM will prevent the transaction from processing and display an error message to the user, indicating that the reported quantity will exceed the job quantity required."
  },
  {
    "need": "Ohara would like the ability when Printing a Quote Form have the ability to define in what sequence the Quote Line Details will display on the form. Presently the Quote Line determines the printing sequence. (1, 2, 3,………)The Development of the Quote Form will also have to be included with O’Hara defining the format of what they would like to see on the Form.Need to created UD Number Field in an Integer format on the Quote Detail table.O’Hara will need the ability to change the number in the sequence to which they want the Quote Line details to display on the Quote Form.",
    "solution": "To address O'Hara's request for customizable print sequencing of quote line details, the following solution will be implemented:UD Field Addition:We will add a new user-defined field to the 'QuoteDtl' table, which will be named 'PrintSequence'. This field will be of integer type, allowing O'Hara's end users to manually set the print sequence for each quote line. This field will have validation to ensure that each number is unique and has not been assigned to another quote line. The field will be a required field meaning it MUST contain a number or the QuoteDtl cannot be saved.Quote Detail Panel Modification:The 'PrintSequence' field will be displayed on the Quote Detail panel within the Quote Entry UI to facilitate easy access and modification by the users.Auto Sequence Calculation:A Business Process Management (BPM) directive will be created to handle the assignment of the 'PrintSequence' value for new quote lines. The first quote line created will automatically be assigned a 'PrintSequence' of 1. For subsequent quote lines, the BPM will calculate the next available sequence number, which will be one greater than the current highest 'PrintSequence' number across all quote lines. This means that if the current print sequence is 1,2,6,7 for the four quote lines on a given quote. The next line will get a print sequence of 8. This of course is only calculated when the quote line is initially created, and the print sequence can be manually modified by the end user afterQuote Form Update:The standard Epicor quote form will be modified to sort quote lines based on the new 'PrintSequence' field instead of the original quote line number. Additionally, the form will display the 'PrintSequence' in place of the original quote line number, while the original quote line number will be removed from the form view. This change will be applied to the base Epicor form only. If there are additional custom forms that O'Hara wishes to update with this new functionality, or if there are additional changes they would like made to the form we will reevaluate the scope and hours needed to implement those changes accordingly.Notes:· All customizations will be completed in the Kinetic Environment"
  },
  {
    "need": "On the Materials card in Quote Engineering, customer wishes to have a field that shows the Material Cost per Parent. This field will be the product of unit cost and Qty per Parent. E.g. if the material unit cost is $100/SH and the Qty per Parent is 0.03SH, the new Material Cost per Parent field would display $3.00. The customer recognizes that Epicor calculates all material costs in the background and summarizes them on the worksheet, but has identified a desire to see the material cost of each material individually.",
    "solution": "A new “Material Cost Per Parent” field will be added directly below the “Unit Cost” field on the Material Detail Card in the Quote Engineering screen.This field will not be editable and will be automatically calculated as follows: UnitCost * QtyPerParentNotes:All customizations will be completed in the Kinetic UI"
  },
  {
    "need": "1. This is a multi-site (4) company environment.2. Inventory for PartNum 79204 potentially resides in all four sites at any one time.3. In this example, a user enters a Sales Order Line for PartNum 79204 and would find it very useful to know the relevant On-Hand Quantity and Available Quantity for the demand site at the time of saving the line.4. Rather, Epicor provides the On-Hand and Available for this PartNum aggregated across all sites (screenshot below)5. The user can only view the Site On-Hand and Available Quantities when navigating to the Order Line Release Detail screen. It will not be practical switch to the Release to view this information. The requirement is to have this information displayed at the Line level.6. Here’s a screenshot of the inventory balances for each Site, so you can see the details behind the screenshots above.7. This is a screenshot of how the user would ultimately like to enter lines and have the relevant On-hand and Available Inventory Quantities displayed, using the grid view.",
    "solution": "Order EntryTwo new fields will be added to both the detail panel and the line detail grid view.· Current Site Available Quantity: This will display the available qty of the current part on the current line for the current site.· Current Site On Hand Quantity: This will display the on hand qty of the current part on the current order line for the current site.These fields will be added directly above the current “Quantities” fields on the Order Detail Panel and Directly to the left of the original two fields in the grid view.Notes:All customization will be completed in the Kinetic UI."
  },
  {
    "need": "Formatop will have many Sales Order Line Release records per sales Order and in order to make the process efficient they would like all the check boxes to be marked as True when the Select All check box is selected, excluded released. (Note, standard Epicor functionality should exist if the released date at is blank, the quantity on the order release must be 1 or greater, Make Direct Check box on the Order release must be true, and there is no existing Job linked to this order release record, then the Order Job Wizard will ignore the record.)Example below all the check boxes in the Order Line would be set as True. (9 check boxes in the red box below.",
    "solution": "Order Job WizardA BPM will be added that replaces the functionality behind the standard “Select All” checkbox. This BPM will do the following:· Retrieve the list of available order lines· Determine which order lines should be selected by following the criteria to not select any lines where any of the following are true:o The released date is blanko The quantity on the order release is less than 1o The \"Make Direct\" checkbox on the order release is falseo There is an existing job linked to the order release record.· This will the mark the following columns as true in the order job wizard screen for all the lines that met the criteria:o Create Jobo Get Detailso Schedule JobAn additional BPM will be added as needed to deselect Jobs if the “Select All” check box is marked as false.Notes:· All customizations will be completed in the Kinetic Environment"
  },
  {
    "need": "1. The user often creates a Quote from a Case.2. The Case has a related ProjectID and PhaseID (Note: adding a related PhaseID is another customization request submitted for Crystal Fountains and this customization assumes that a Case can have a related PhaseID)a. Problem: Once the new Quote is created, the user must manually relate (populate) each quote line with a ProjectID and PhaseID. A query of the QuoteHead table shows that it does not contain a ProjectID and PhaseID field. i. Add the ProjectID and PhaseID fields to the Quote Head and have them populated with the related data, if generated from a Case. Or, allow the user to manually populate these two fields from the Quote Head details screen. ii. Requirement: Have the ProjectID and PhaseID data values default into each new quote line, from the values specified in the Quote Head",
    "solution": "Six will complete the following:Quote Entry Modification:A new “Project” and “Project Phase” will be added to the quote header panel. Project will be a standard Project ID field that is searchable, and the Project Phase field will be a combo box that displays a selection of phases based on what project is selected. These fields will allow a user to manually update a project or phase for a quote as needed.Automatic Project Phase Selection:When a quote Is created from a case and that case has a project or a project and project phase assigned to it. That project and phase will copy to the newly created quote.Notes:· All customizations will be completed in the Kinetic environment.· Changes to the project and phase on a case or quote AFTER a quote has already been created WILL NOT automatically sync with already created quotes and vice versa."
  },
  {
    "need": "1. User creates a Case and relates it to a Project.a. Problem 1: Can only relate to a Project, cannot relate to the Project Phase. i. Requirement: add the ability to relate the Case to both a Project and Project Phase.b. Problem 2: Once related, the user cannot ‘see’ related Cases when working in the Project Entry program. i. Requirement: add the ability to see related Cases from within the Project Entry program. ii. The display of related cases should be added as a card on the Project Phase​",
    "solution": "Six S will complete the following:Modification to Case Entry:A New “Project Phase” drop down field will be added below the Project field in Case entry. This will list all phases for the selected project on the case. Users can select a phase from this drop down to specify that a case is linking to that given phase. Modification to Project EntryA new “Linked Cases” card will be added to the “WBS Phase Detail Panel” in project Entry. This card will display all Cases that are linked to the given Project and WBS phase. Included in this list will be the Case number, Full Description, Entry Date and Entry Person.Note:All customizations will be completed in the Kinetic environment."
  },
  {
    "need": "Crystal Fountains requires the addition of two new database objects in the Project Entry program.1. “Source”a. Every ProjectID must have a “Source”.b. Located at the Project header level.c. Should be in the format of a dropdown combo-box with the following selections: i. Owner ii. LARCH iii. Aquatic Designer iv. General Contractor v. Specialty Contractor vi. Unknown vii. Lighting Designer viii. Partnerd. When a new project is created, the user will select one of the above “Source”e. As the project progresses the user may change their “Source” selection, and possibly even more than once before the project is completed.f. The “Source” is information data for the project manager, who uses it to categorize their ProjectIDs. It may be used for filtering the landing page.2. “Project Team”a. The following “Project Team” are defined and every ProjectID must have a minimum of one “Project Team” populated: i. Project Owner ii. Architect iii. L. Architect iv. MEP Engineer v. Aquatic Designer vi. Light Designer vii. Contractorb. The “Project Team” field will be populated with a Customer from Customer Maintenance.c. Each “Project Team” will be a search button to help the user select a record for the field.d. Below is a screenshot of the screen as it is currently laid out in the Crystal Fountains legacy application. This is the “Source” layout.This is the “Project Team” layout.",
    "solution": "Project Source· A new “Project Source” combo box will be added to the Project Detail screen that allows the selection of values from a “Project Source” User code.o The project source user code will have the following values:CodeDescriptionOWNROwnerLARCLandscape ArchitectAQDSAquatic DesignerGNCTGeneral ContractorSPCTSpecialty ContractorLGDSLighting DesignerPRTNPartnerUNKNUnknownProject Team· Project Team Panel (App Studio Layer): A new Project Team panel will be added beneath the detail panel in project entry. This will consist of 7 fields. Each field will have a search available for it and that search will allow the user to search for a customer record to save to the given field. (See Project Team Mock up in the design need section of this document for more detail on what this looks like in the customers old system)o The fields are as follows:§ Project Owner§ Architect§ Landscape Architect§ MEP Engineer§ Aquatic Designer§ Light Designer§ Contractoro Only valid customers will be allowed to be saved to these fields.· Force One Project Team Member (BPM): When a user attempts to save a project without filling out at least one project team member an error will be shown letting the user know that this needs to be done.Note:· All customizations will be completed in the Kinetic environment.· Any addition of these fields as filters for views elsewhere in Epicor is not included in the scope of this project."
  },
  {
    "need": "When adding Misc. Charges to either a PO, a Receipt or a Misc. Invoice, creating an Advanced Payment for a PO for any Site, and making a Supplier Payment with a Payment Discount, the Division segment needs to flex (override) the default value coming from the Misc. Charge(Purchase) GL Control and AP Invoice GL Control with the Site Division GL Control.  \nWhen creating an AP Receipt Line Invoice for any Site the Division segment for the AP Clearing Accrued account needs to flex (override) the default value coming from the Inventory COS and WIP GL Control with the Site Division GL Control. \nEpicor support says this is working as designed. If more information is required we can schedule a call to discuss requirements.\n",
    "solution": "Six S will make modifications to each posting rule as requested. For each transaction type mentioned, the Division segment will be updated to override the default value coming from the respective GL Controls with the Site Division GL Control.\nThe posting rule changes will be made to the following areas: \n•\tPO Misc Charge\n•\tReceipt Misc Charge\n•\tMisc AP Invoice Misc Charge\n•\tAdvanced Payment for PO\n•\tSupplier Payment\n•\tAP Receipt Line Invoice: AP Clearing Accrued Account\n"
  }
]